In [ ]:
import json
import pandas as pd
import numpy as np

In [125]:
#1. Load the CSV file (`messy_data.csv`) into a pandas DataFrame.
df = pd.read_csv('./data/messy_data.csv')

In [126]:
df.head(10)

   id    age  height  weight   income purchases   gender
0   1   25.0   175.0      68  35000.0  23,45,12     male
1   2    NaN   182.0      80  42000.0    34,,19   female
2   3  150.0   165.0     180  28000.0       NaN  unknown
3   4   34.0   168.0      70      NaN    ,55,67     male
4   5   29.0   190.0     165  31000.0  12,19,23   female
5   6   42.0     NaN      82  37000.0  40,41,42     male
6   7    NaN   -99.0     190      NaN      23,,   female
7   8   38.0   172.0      75  39000.0     22,20  unknown
8   9   44.0   180.0     160  41000.0       NaN     male
9  10   33.0   160.0     130      0.0  14,13,12    other

2. Explore the data:
- What values are missing? 
- Are there any unrealistic values? (e.g., age = 150, height = -99)
- Are there format or type issues that need fixing?

3. Clean the data step-by-step:
-3.1 Handle missing values (you decide how)
-3.2 Identify and process outliers (you define the thresholds)
-3.3 Normalize relevant numerical columns (e.g., height, weight, income)
-3.4 Convert categorical values to numerical format using one-hot encoding
-3.5 Ensure all height values are valid (e.g., no negatives)

In [127]:
#3.1 Handle missing values you decide how)
#calculate average
average_age = df['age'].mean()
average_height = df['height'].mean()
average_income = df['income'].mean()

In [128]:
print(average_age)
print(average_height)
print(average_income)

49.375
143.66666666666666
31625.0

In [129]:
#fill in the missing value using average data
df['age']= df['age'].fillna(round(average_age)) 
df['height']= df['height'].fillna(round(average_height))
df['income']= df['income'].fillna(round(average_income))

In [130]:
df.head(10)

   id    age  height  weight   income purchases   gender
0   1   25.0   175.0      68  35000.0  23,45,12     male
1   2   49.0   182.0      80  42000.0    34,,19   female
2   3  150.0   165.0     180  28000.0       NaN  unknown
3   4   34.0   168.0      70  31625.0    ,55,67     male
4   5   29.0   190.0     165  31000.0  12,19,23   female
5   6   42.0   144.0      82  37000.0  40,41,42     male
6   7   49.0   -99.0     190  31625.0      23,,   female
7   8   38.0   172.0      75  39000.0     22,20  unknown
8   9   44.0   180.0     160  41000.0       NaN     male
9  10   33.0   160.0     130      0.0  14,13,12    other

In [131]:
#3.2 Identify and process outliers (you define the thresholds)
#setting a bonder/rule here
max_age = 100
max_weight = 150
min_height = 140

In [132]:
#replace any value that over max value
#using lamda

df['age'] = df['age'].apply(lambda x: min(x, max_age))
df['weight'] = df['weight'].apply(lambda x: min(x, max_weight))

df.head(10)

   id    age  height  weight   income purchases   gender
0   1   25.0   175.0      68  35000.0  23,45,12     male
1   2   49.0   182.0      80  42000.0    34,,19   female
2   3  100.0   165.0     150  28000.0       NaN  unknown
3   4   34.0   168.0      70  31625.0    ,55,67     male
4   5   29.0   190.0     150  31000.0  12,19,23   female
5   6   42.0   144.0      82  37000.0  40,41,42     male
6   7   49.0   -99.0     150  31625.0      23,,   female
7   8   38.0   172.0      75  39000.0     22,20  unknown
8   9   44.0   180.0     150  41000.0       NaN     male
9  10   33.0   160.0     130      0.0  14,13,12    other

In [133]:
#replace any value that lower min value
#using lamda
df['height'] = df['height'].apply(lambda x: max(min_height, x))

df.head(10)

   id    age  height  weight   income purchases   gender
0   1   25.0   175.0      68  35000.0  23,45,12     male
1   2   49.0   182.0      80  42000.0    34,,19   female
2   3  100.0   165.0     150  28000.0       NaN  unknown
3   4   34.0   168.0      70  31625.0    ,55,67     male
4   5   29.0   190.0     150  31000.0  12,19,23   female
5   6   42.0   144.0      82  37000.0  40,41,42     male
6   7   49.0   140.0     150  31625.0      23,,   female
7   8   38.0   172.0      75  39000.0     22,20  unknown
8   9   44.0   180.0     150  41000.0       NaN     male
9  10   33.0   160.0     130      0.0  14,13,12    other

In [134]:
#3.3 Normalize relevant numerical columns (e.g., height, weight, income)
#start with maximum value 
# using pandas
max_height = df['height'].max()
max_weight = df['weight'].max()
max_income = df['income'].max()

In [135]:
#if the max value is 0, diveded by 0 will be a problem, so need change to 1
max_height = max_height if max_height !=0 else 1
max_weight = max_weight if max_weight !=0 else 1
max_income = max_income if max_income !=0 else 1

In [136]:
# divide by maximum value 
df['height'] = df['height'] / max_height
df['weight'] = df['weight'] / max_weight
df['income'] = df['income'] / max_income

In [137]:
# see the normalization data
df.head(10)

   id    age    height    weight    income purchases   gender
0   1   25.0  0.921053  0.453333  0.833333  23,45,12     male
1   2   49.0  0.957895  0.533333  1.000000    34,,19   female
2   3  100.0  0.868421  1.000000  0.666667       NaN  unknown
3   4   34.0  0.884211  0.466667  0.752976    ,55,67     male
4   5   29.0  1.000000  1.000000  0.738095  12,19,23   female
5   6   42.0  0.757895  0.546667  0.880952  40,41,42     male
6   7   49.0  0.736842  1.000000  0.752976      23,,   female
7   8   38.0  0.905263  0.500000  0.928571     22,20  unknown
8   9   44.0  0.947368  1.000000  0.976190       NaN     male
9  10   33.0  0.842105  0.866667  0.000000  14,13,12    other

In [ ]:
#3.4 Convert categorical values to numerical format using one-hot encoding

#replace gender to  0,1 
#df['gender'] = df['gender'].apply(lambda g: [1,0] if g == 'male' else [0,1])

# 处理gender列
def convert_gender(gender):
    # 将male设为[1,0]，其他都设为[0,1]
    if str(gender).strip().lower() == 'male':
        return [1, 0]
    else:
        return [0, 1]

# 应用转换
df['gender'] = df['gender'].apply(convert_gender)

# 显示结果
df.head(10)

   id    age    height    weight    income purchases  gender
0   1   25.0  0.921053  0.453333  0.833333  23,45,12  [1, 0]
1   2   49.0  0.957895  0.533333  1.000000    34,,19  [0, 1]
2   3  100.0  0.868421  1.000000  0.666667       NaN  [0, 1]
3   4   34.0  0.884211  0.466667  0.752976    ,55,67  [1, 0]
4   5   29.0  1.000000  1.000000  0.738095  12,19,23  [0, 1]
5   6   42.0  0.757895  0.546667  0.880952  40,41,42  [1, 0]
6   7   49.0  0.736842  1.000000  0.752976      23,,  [0, 1]
7   8   38.0  0.905263  0.500000  0.928571     22,20  [0, 1]
8   9   44.0  0.947368  1.000000  0.976190       NaN  [1, 0]
9  10   33.0  0.842105  0.866667  0.000000  14,13,12  [0, 1]

4. Convert the `purchases` column:
- This column is a string – convert it into a list of numbers
- Replace missing values inside the list (e.g., empty strings) with 0

In [139]:
"""
#Change purchases data from string to list of numbers
#另一种方式

#定义一个函数来处理每个purchases字符串
def convert_purchases_to_list(purchases):
    if pd.isna(purchases): #if is NaN
        return [0]

#seperate the str, get into list of string
    parts = str(purchases).split(',')

#change every parts into interger, empty str convert to 0
    result = []
    for part in parts:
        part = part.strip() #去除空格
        if part == '' or part.isspace(): #如果是空字符串
            result.append(0)
        else:
            try:
                result.append(int(float(part))) #covert into interger
            except:
                result.append(0)  #if can't covert make it 0
    return result

#应用函数到purchases列
df['purchases']=df['purchases'].apply(convert_purchases_to_list)

#查看转换后结果
df[['id','purchases']].head(10)
"""

"\n#Change purchases data from string to list of numbers\n\n#定义一个函数来处理每个purchases字符串\ndef convert_purchases_to_list(purchases):\n    if pd.isna(purchases): #if is NaN\n        return [0]\n\n#seperate the str, get into list of string\n    parts = str(purchases).split(',')\n\n#change every parts into interger, empty str convert to 0\n    result = []\n    for part in parts:\n        part = part.strip() #去除空格\n        if part == '' or part.isspace(): #如果是空字符串\n            result.append(0)\n        else:\n            try:\n                result.append(int(float(part))) #covert into interger\n            except:\n                result.append(0)  #if can't covert make it 0\n    return result\n\n#应用函数到purchases列\ndf['purchases']=df['purchases'].apply(convert_purchases_to_list)\n\n#查看转换后结果\ndf[['id','purchases']].head(10)\n"

In [140]:
# 简洁版本（修复版）列表推导式
def convert_purchases(purchases):
    if pd.isna(purchases):
        return [0]
    parts = str(purchases).split(',')
    # 修复：这里应该是 != '' 而不是 != ','
    return [int(float(p.strip())) if p.strip() != '' else 0 for p in parts]

# 应用函数到purchases列
df['purchases'] = df['purchases'].apply(convert_purchases)

# 修复print语句：应该是两个方括号，不是圆括号
df.head(10)

   id    age    height    weight    income     purchases  gender
0   1   25.0  0.921053  0.453333  0.833333  [23, 45, 12]  [1, 0]
1   2   49.0  0.957895  0.533333  1.000000   [34, 0, 19]  [0, 1]
2   3  100.0  0.868421  1.000000  0.666667           [0]  [0, 1]
3   4   34.0  0.884211  0.466667  0.752976   [0, 55, 67]  [1, 0]
4   5   29.0  1.000000  1.000000  0.738095  [12, 19, 23]  [0, 1]
5   6   42.0  0.757895  0.546667  0.880952  [40, 41, 42]  [1, 0]
6   7   49.0  0.736842  1.000000  0.752976    [23, 0, 0]  [0, 1]
7   8   38.0  0.905263  0.500000  0.928571      [22, 20]  [0, 1]
8   9   44.0  0.947368  1.000000  0.976190           [0]  [1, 0]
9  10   33.0  0.842105  0.866667  0.000000  [14, 13, 12]  [0, 1]

5. Save your cleaned DataFrame as a new CSV file (`cleaned_data.csv`).

In [ ]:
#需要将列表转换成字符串才能保存到CSV
#CSV只能储存简单数据 str number data
#change the "purchases" "gender" list into string then we can save data into CSV

df_to_save = df.copy()
df_to_save['purchases'] = df_to_save['purchases'].apply(lambda x: ','.join(map(str, x)))
df_to_save['gender'] = df_to_save['gender'].apply(lambda x: ','.join(map(str, x)))

df_to_save.to_csv('cleaned_data.csv', index=False)
print("数据已保存到 cleaned_data.csv")

数据已保存到 cleaned_data.csv